# Даны положительные числа A, B, C. На прямоугольнике размера A x B размещено максимально 
# возможное количество квадратов со стороной C (без наложений). Найти количество квадратов, 
# размещенных на прямоугольнике. Операции умножения и деления не использовать.




# *.Спортсмен-лыжник начал тренировки, пробежав в первый день 10 км. Каждый следующий день он
# увеличивал длину пробега на P процентов от пробега предыдущего дня (P — вещественное, 0 < P < 50).
# По данному P определить, после какого дня суммарный пробег лыжника за все дни превысит 200 км, и 
# вывести найденное количество дней K (целое) и суммарный пробег S (вещественное число).



# 5. Сумма дробей (часть первая)
# Пользователь вводит число N. Найдите сумму чисел: 1 + 1.1 + 1.2 + 1.3 + ... + (1 + N / 10).

# # Ввод:
# >> 5
# # Вывод:
# >> 7.5




# 6. Сумма дробей (часть вторая)
# Пользователь вводит число N. Найдите сумму чисел: 1 + 1/2 + 1/3 + ... + 1/N

# # Ввод:
# >> 5
# # Вывод:
# >> 2.283